In [1]:
from piper import piper
from piper.verbs import *
import pandas as pd

In [2]:
def clean_column(column):
    
    return (column.str.replace('\s+', ' ', regex=True)
                  .str.title()
                  .str.replace(r'(.*)\s(.*)', r'\2 \1', regex=True)
                  .str.replace('ri', 'ir', regex=True))

In [3]:
xl_file = 'inputs/Test excel workbook.xlsx'

renamed_cols = [
    'grouping_code', 'order', 'first_col', 'second_col', 'qty', 'price',
    'effective', 'expired', 'transaction_date', 'delimitted_list'
]

In [4]:
%%piper

df <- pd.read_excel(xl_file)
>> set_columns(renamed_cols)
>> move_column('order', loc='before', ref_column='grouping_code').head()
>> assign(delimitted_list = lambda x: x.delimitted_list.str.split(';')).explode('delimitted_list')
>> assign(first_col = lambda x: clean_column(x.first_col))

In [5]:
head(df)

15 rows, 10 columns

,order,grouping_code,first_col,second_col,qty,price,effective,expired,transaction_date,delimitted_list
0,23899001,A100,Row First,"Scally, Aidan",14,"1,23",21.10.2015,31.12.2019,20.08.2018,123
0,23899001,A100,Row First,"Scally, Aidan",14,"1,23",21.10.2015,31.12.2019,20.08.2018,456
0,23899001,A100,Row First,"Scally, Aidan",14,"1,23",21.10.2015,31.12.2019,20.08.2018,789
1,23899002,A101,Row Second,"McAllister, Eoin",103,"4,32",21.10.2016,31.12.2020,20.08.2017,ss

In [6]:
%piper df >> count('grouping_code', normalize=True)

  grouping_code    n
0          A101  0.4
1          A103  0.2
2          A100  0.2
3          A102  0.2

In [7]:
%%piper

df >> count('grouping_code', add_total=True, percent=True, cum_percent=True)

   index   n      %  cum %
0   A101   6   40.0   40.0
1   A103   3   20.0   60.0
2   A100   3   20.0   80.0
3   A102   3   20.0  100.0
4  Total  15  200.0  280.0